Catalogs/ТочкиЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ТочкиЦелевые</Name>
			<Comment>Целевые точки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Comment>Очередь подсистемы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПроекта</Name>
					<Comment>Код проекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактЦентр</Name>
					<Comment>Обслуживающий контакт-центр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы по-умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьСМС</Name>
					<Comment>Учетная запись для отправки визитных карточек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлючиВИсточникахДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>Момент времени установки ГУИД</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКлюча</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКлюча</Name>
							<Comment>Идентификатор (ГУИД для справочника) в источнике данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКлюча</Name>
							<Comment>Для справочника - наименование; для перечисления - представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопПредставлениеКлюча</Name>
							<Comment>Для справочника - код, для перечисления - порядковый номер значения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТочкиЦелевые/Ext/ManagerModule.bsl
Функция СрезПоследних(Период, ЗначенияКлючей) Экспорт
	
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ТочкиЦелевые"));
	ТЗ.Колонки.Добавить("КлючИсточник", Новый ОписаниеТипов("Строка"));
	
	ЗначениеПоУмолчанию = ТЗ;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ключи.Ссылка КАК Ссылка,
	|	Ключи.Период КАК Период,
	|	Ключи.ЗначениеКлюча КАК ЗначениеКлюча
	|ПОМЕСТИТЬ ВТ01_Детальные
	|ИЗ
	|	Справочник.ТочкиЦелевые.КлючиВИсточникахДанных КАК Ключи
	|ГДЕ
	|	Ключи.Период <= &Период
	|	И Ключи.ЗначениеКлюча В(&ЗначенияКлючей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ01_Детальные.Ссылка КАК Ссылка,
	|	ВТ01_Детальные.ЗначениеКлюча КАК ЗначениеКлюча,
	|	МАКСИМУМ(ВТ01_Детальные.Период) КАК Период
	|ИЗ
	|	ВТ01_Детальные КАК ВТ01_Детальные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ01_Детальные.Ссылка,
	|	ВТ01_Детальные.ЗначениеКлюча";
	
	Если Не ЗначениеЗаполнено(ЗначенияКлючей) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ключи.ЗначениеКлюча В(&ЗначенияКлючей)", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("ЗначенияКлючей", ЗначенияКлючей);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Ссылка = Выборка.Ссылка;
		НоваяСтрока.КлючИсточник = Выборка.ЗначениеКлюча;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции
